In [174]:
import pandas as pd
import numpy as np

In [175]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [176]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

#### Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [177]:
for i in range(len(df['FlightNumber'])):
    #print(df['FlightNumber'][i])
    if pd.isna(df['FlightNumber'][i]):
        df['FlightNumber'][i] = df['FlightNumber'][i-1]+10

<ipython-input-177-02283c7cd5dc>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['FlightNumber'][i] = df['FlightNumber'][i-1]+10

In [178]:
df['FlightNumber'] = df['FlightNumber'].astype(int)

#### 2. The From_To column would be better as two separate columns! Split eachstring on the underscore delimiter _ to give a new temporary DataFrame with the correct

In [179]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [180]:
df_temp =pd.DataFrame({'Start of journey': [],'Destination of journey':[]})

In [181]:
df_temp['Start of journey'] = df['From_To'].str.split('_',expand=True)[0]

In [182]:
df_temp['Destination of journey'] = df['From_To'].str.split('_',expand=True)[1]

In [183]:
df_temp.head()

  Start of journey Destination of journey
0           LoNDon                  paris
1           MAdrid                  miLAN
2           londON              StockhOlm
3         Budapest                  PaRis
4         Brussels                 londOn

#### 3)Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [184]:
df_temp['Start of journey'] = df_temp['Start of journey'].apply(lambda x : x.capitalize())

In [185]:
df_temp['Destination of journey'] = df_temp['Destination of journey'].apply(lambda x : x.capitalize())

In [186]:
df_temp.head()

  Start of journey Destination of journey
0           London                  Paris
1           Madrid                  Milan
2           London              Stockholm
3         Budapest                  Paris
4         Brussels                 London

#### 4. Delete the From_To column from df and attach the temporary DataFramefrom the previous questions.

In [187]:
df['Start of journey'] = df_temp['Start of journey']
df['Destination of journey'] = df_temp['Destination of journey']

In [188]:
df = df.drop(columns = 'From_To')

In [189]:
df.head()

,FlightNumber,RecentDelays,Airline,Start of journey,Destination of journey
0,10045,"[23, 47]",KLM(!),London,Paris
1,10055,[],<Air France> (12),Madrid,Milan
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,10075,[13],12. Air France,Budapest,Paris
4,10085,"[67, 32]","""Swiss Air""",Brussels,London

#### 5. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [190]:
delays = pd.DataFrame(df['RecentDelays'].to_list(),columns = ['delay_1', 'delay_2', 'delay_3'])
delays

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [191]:
df['delay_1'] = delays.delay_1
df['delay_2'] = delays.delay_2
df['delay_3'] = delays.delay_3

In [192]:
df.head()

,FlightNumber,RecentDelays,Airline,Start of journey,Destination of journey,delay_1,delay_2,delay_3
0,10045,"[23, 47]",KLM(!),London,Paris,23.0,47.0,NaN
1,10055,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,[13],12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"[67, 32]","""Swiss Air""",Brussels,London,67.0,32.0,NaN